modm-ext/data.modm.io/docs/svd/header_stm32wba62xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP1</name>
      <description>Analog comparators (COMP)</description>
      <groupName>COMP</groupName>
      <alternatePeripheral>COMP12_COMMON</alternatePeripheral>
      <baseAddress>0x46005400</baseAddress>
      <interrupt>
        <name>COMP</name>
        <description>COMP1 and COMP2 through EXTI Lines interrupts</description>
        <value>53</value>
      </interrupt>
      <registers>
        <register>
          <name>CSR</name>
          <description>Comparator control and status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Comparator enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INMSEL</name>
              <description>Comparator input minus selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINUS_1_4VREFINT</name>
                  <description>Comparator input minus connected to 1/4 VrefInt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINUS_1_2VREFINT</name>
                  <description>Comparator input minus connected to 1/2 VrefInt</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINUS_3_4VREFINT</name>
                  <description>Comparator input minus connected to 3/4 VrefInt</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFINT</name>
                  <description>Comparator input minus connected to VrefInt</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO1</name>
                  <description>Comparator input minus connected to IO1 (pin PA1 for COMP1, pin PB9 for COMP2)</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPSEL</name>
              <description>Comparator input plus selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WINMODE</name>
              <description>Pair of comparators window mode. Bit intended to be used with COMP common instance (COMP_Common_TypeDef)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINOUT</name>
              <description>Pair of comparators window output level. Bit intended to be used with COMP common instance (COMP_Common_TypeDef)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POLARITY</name>
              <description>Comparator output polarity</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONINVERTED</name>
                  <description>COMP output polarity is not inverted: comparator output is high when the plus (non-inverting) input is at a higher voltage than the minus (inverting) input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>COMP output polarity is inverted: comparator output is low when the plus (non-inverting) input is at a lower voltage than the minus (inverting) input</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYST</name>
              <description>Comparator input hysteresis</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No hysteresis</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Hysteresis level low</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDIUM</name>
                  <description>Hysteresis level medium</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Hysteresis level high</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRMODE</name>
              <description>Comparator power mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGHSPEED</name>
                  <description>COMP power mode to high speed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERMSPEED</name>
                  <description>COMP power mode to intermediate speed</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDIUMSPEED</name>
                  <description>COMP power mode to medium speed</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULTRALOWPOWER</name>
                  <description>COMP power mode to ultra-low power</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLANKSEL</name>
              <description>Comparator blanking source</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Comparator output without blanking</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_OC5_COMP1</name>
                  <description>Comparator output blanking source TIM1 OC5 (specific to COMP instance: COMP1)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_OC3_COMP1</name>
                  <description>Comparator output blanking source TIM2 OC3 (specific to COMP instance: COMP1)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_OC3_COMP1</name>
                  <description>Comparator output blanking source TIM3 OC3 (specific to COMP instance: COMP1)</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALUE</name>
              <description>Comparator output level</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCK</name>
              <description>Comparator lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
