modm-ext/data.modm.io/docs/svd/header_stm32wba62xx.svd
        <register>
          <name>IORETENRG</name>
          <description>PWR Port G IO retention in Standby register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN2</name>
              <description>Standby GPIO retention enable for PG2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN3</name>
              <description>Standby GPIO retention enable for PG3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN4</name>
              <description>Standby GPIO retention enable for PG4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN5</name>
              <description>Standby GPIO retention enable for PG5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN6</name>
              <description>Standby GPIO retention enable for PG6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN7</name>
              <description>Standby GPIO retention enable for PG7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN8</name>
              <description>Standby GPIO retention enable for PG8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN9</name>
              <description>Standby GPIO retention enable for PG9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN10</name>
              <description>Standby GPIO retention enable for PG10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN11</name>
              <description>Standby GPIO retention enable for PG11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN12</name>
              <description>Standby GPIO retention enable for PG12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN13</name>
              <description>Standby GPIO retention enable for PG13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN14</name>
              <description>Standby GPIO retention enable for PG14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN15</name>
              <description>Standby GPIO retention enable for PG15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IORETRG</name>
          <description>PWR Port G IO retention status in Standby register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN2</name>
              <description>Standby GPIO retention status for PG2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN3</name>
              <description>Standby GPIO retention status for PG3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN4</name>
              <description>Standby GPIO retention status for PG4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN5</name>
              <description>Standby GPIO retention status for PG5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN6</name>
              <description>Standby GPIO retention status for PG6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN7</name>
              <description>Standby GPIO retention status for PG7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN8</name>
              <description>Standby GPIO retention status for PG8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN9</name>
              <description>Standby GPIO retention status for PG9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN10</name>
              <description>Standby GPIO retention status for PG10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN11</name>
              <description>Standby GPIO retention status for PG11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN12</name>
              <description>Standby GPIO retention status for PG12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN13</name>
              <description>Standby GPIO retention status for PG13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN14</name>
              <description>Standby GPIO retention status for PG14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN15</name>
              <description>Standby GPIO retention status for PG15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IORETENRH</name>
          <description>PWR Port H IO retention in Standby register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN3</name>
              <description>Standby GPIO retention enable for PH3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IORETRH</name>
          <description>PWR Port H IO retention status in Standby register</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RET3</name>
              <description>Standby GPIO retention status for PH3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RADIOSCR</name>
          <description>PWR 2.4 GHZ radio status and control register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODE</name>
              <description>2.4 GHz RADIO operating mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PHYMODE</name>
              <description>2.4 GHz RADIO PHY operating mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLEEP_MODE</name>
                  <description>2.4 GHz RADIO Sleep mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STANDBY_MODE</name>
                  <description>2.4 GHz RADIO Standby mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENCMODE</name>
              <description>2.4 GHz RADIO encryption function operating mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFVDDHPA</name>
              <description>2.4 GHz RADIO VDDHPA control word</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>REGPARDYVDDRFPA</name>
              <description>Ready bit for VDDHPA voltage level when selecting VDDRFPA input</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>S2RETR</name>
          <description>PWR Stop 2 peripheral IOs retention register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PTASREN</name>
              <description>PTA output signals Stop 2 mode retention enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PTASR</name>
              <description>PTA interface output signals state retention in Stop 2 mode active</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
